#pragma once

/*****************************************
*	ディレクションライトクラス.
*****************************************/
class DirectionLight final
{
public:
	DirectionLight();
	~DirectionLight();

	/*************************************************************************
	* @brief ライトのビュー、プロジェクションの更新.
	* ************************************************************************/
	void UpdateViewAndProjection();

private:

	/*************************************************************************
	* @brief ビュー行列の更新.
	*************************************************************************/
	void View();


	/*************************************************************************
	* @brief プロジェクション行列の更新.
	* ************************************************************************/
	void projection();

public: // Getter、Setter.

	/*************************************************************************
	* @brief ライトの座標を取得・設定.
	* @note GetPosition：取得.
	* @note SetPosition：設定.
	*************************************************************************/
	const DirectX::XMFLOAT3& GetPosition() const;
	void SetPosition(const DirectX::XMFLOAT3& Position);
	

	/*************************************************************************
	* @brief ライトの方向を取得・設定.
	* @note GetDirection：取得.
	* @note SetDirection：設定.
	* ************************************************************************/
	const DirectX::XMFLOAT3& GetDirection() const;
	void SetDirection(const DirectX::XMFLOAT3& direction);


	/*************************************************************************
	* @brief ビュー行列を取得.
	* ************************************************************************/
	const DirectX::XMMATRIX GetViewMatrix() const;


	/*************************************************************************
	* @brief プロジェクション行列を取得.
	* ************************************************************************/
	const DirectX::XMMATRIX GetProjectionMatrix() const;

private:
	DirectX::XMFLOAT3 m_Position;
	DirectX::XMFLOAT3 m_Direction;
	DirectX::XMMATRIX	m_View;
	DirectX::XMMATRIX	m_Projection;
};
